In [45]:
import pandas as pd

In [46]:
serie = pd.Series([1,2,4,5,6], index = ['a','b','c','d','e'])

In [47]:
serie

a    1
b    2
c    4
d    5
e    6
dtype: int64

In [48]:
diccionario = {'a':5, 'b':6, 'c':89, 'd':97}

In [49]:
serie1 = pd.Series(diccionario)

In [50]:
serie1

a     5
b     6
c    89
d    97
dtype: int64

In [51]:
serie1['d']

np.int64(97)

In [52]:
serie1[2:]

c    89
d    97
dtype: int64

In [53]:
serie1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [54]:
serie1.values

array([ 5,  6, 89, 97])

In [55]:
resultado = serie1 + serie

In [56]:
resultado

a      6.0
b      8.0
c     93.0
d    102.0
e      NaN
dtype: float64

In [57]:
serie1 * 10

a     50
b     60
c    890
d    970
dtype: int64

In [58]:
import numpy as np

In [59]:
np.sqrt(serie1)

a    2.236068
b    2.449490
c    9.433981
d    9.848858
dtype: float64

In [60]:
dic1 = {'columna1': pd.Series([1,2,4,5,6], index = ['a','b','c','d','e']), 'columna 2': pd.Series([8,9,10,11], index = ['a','b','c','d'])}

In [61]:
dataframe = pd.DataFrame(dic1)

In [62]:
dataframe

   columna1  columna 2
a         1        8.0
b         2        9.0
c         4       10.0
d         5       11.0
e         6        NaN

In [63]:
lista = [{'a': 1, 'b': 5, 'c': 7}, {'c': 1, 'h': 5, 'b': 7}]

In [64]:
dataframe1 = pd.DataFrame(lista)

In [65]:
dataframe1

     a  b  c    h
0  1.0  5  7  NaN
1  NaN  7  1  5.0

In [66]:
dataframe1['b']

0    5
1    7
Name: b, dtype: int64

In [67]:
dataframe1['t'] = pd.Series([5,2], index = [0,1])

In [68]:
dataframe1

     a  b  c    h  t
0  1.0  5  7  NaN  5
1  NaN  7  1  5.0  2

In [69]:
dataframe['columna 3'] = pd.Series([1,2,4,5,6], index = ['a','b','c','d','e'])

In [70]:
dataframe

   columna1  columna 2  columna 3
a         1        8.0          1
b         2        9.0          2
c         4       10.0          4
d         5       11.0          5
e         6        NaN          6

In [71]:
del dataframe['columna1']

In [72]:
dataframe

   columna 2  columna 3
a        8.0          1
b        9.0          2
c       10.0          4
d       11.0          5
e        NaN          6

In [73]:
dataframe.loc['b']

columna 2    9.0
columna 3    2.0
Name: b, dtype: float64

In [74]:
dataframe.iloc[1]

columna 2    9.0
columna 3    2.0
Name: b, dtype: float64

In [75]:
dataframe.iloc[3]

columna 2    11.0
columna 3     5.0
Name: d, dtype: float64

In [77]:
filtro = np.array([True, False, True, False, True])

In [78]:
dataframe[filtro]

   columna 2  columna 3
a        8.0          1
c       10.0          4
e        NaN          6

In [79]:
dataframe.T

             a    b     c     d    e
columna 2  8.0  9.0  10.0  11.0  NaN
columna 3  1.0  2.0   4.0   5.0  6.0

In [83]:
dataframe.sort_values(by='columna 2')

   columna 2  columna 3
a        8.0          1
b        9.0          2
c       10.0          4
d       11.0          5
e        NaN          6

In [85]:
dataframe.sort_values(by='columna 3', ascending = False)

   columna 2  columna 3
e        NaN          6
d       11.0          5
c       10.0          4
b        9.0          2
a        8.0          1

In [88]:
dataframe.groupby('columna 2').count()

           columna 3
columna 2
8.0                1
9.0                1
10.0               1
11.0               1

In [90]:
dataframe.apply(lambda item: item['columna 2']<35 and item['columna 3'] == 2, axis = 1)

a    False
b     True
c    False
d    False
e    False
dtype: bool

In [92]:
dataframe.describe()

       columna 2  columna 3
count   4.000000   5.000000
mean    9.500000   3.600000
std     1.290994   2.073644
min     8.000000   1.000000
25%     8.750000   2.000000
50%     9.500000   4.000000
75%    10.250000   5.000000
max    11.000000   6.000000

In [94]:
passengers = pd.read_csv('titanic.csv')

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley",female,38.0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath",female,35.0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,S
5,6,0,3,"Moran, Mr. James",male,NaN,8.4583,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,51.8625,S
7,8,1,3,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,S
8,9,1,3,"Johnson, Mrs. Oscar W",female,27.0,11.1333,S
9,10,0,2,"Nasser, Mrs. Nicholas",female,14.0,30.0708,C